In [47]:
import pandas as pd
import numpy as np

In [48]:
data = pd.DataFrame({
    'Nama': ['budi','budi', 'putra', 'nedy', 'David', 'rico'],
    'umur': [25,25, 30, np.nan, 28, 22],
    'gaji': [50000,50000, 60000, 55000, 45000, 70000],
    'negara': ['ID','ID', 'UK', 'ID', 'USA', 'UK']
})

In [49]:
data

    Nama  umur   gaji negara
0   budi  25.0  50000     ID
1   budi  25.0  50000     ID
2  putra  30.0  60000     UK
3   nedy   NaN  55000     ID
4  David  28.0  45000    USA
5   rico  22.0  70000     UK

In [50]:
#menampilkan nama nama kolom
data.columns

Index(['Nama', 'umur', 'gaji', 'negara'], dtype='object')

In [51]:
#menampilkan ukuran data frame
data.shape

(6, 4)

In [52]:
#cari data kosong
data.isna().sum()

Nama      0
umur      1
gaji      0
negara    0
dtype: int64

In [53]:
#data kosong
data.isna().value_counts()

Nama   umur   gaji   negara
False  False  False  False     5
       True   False  False     1
Name: count, dtype: int64

In [54]:
data.dtypes

Nama       object
umur      float64
gaji        int64
negara     object
dtype: object

In [55]:
#mengisi data kosong
data['umur'] = data['umur'].fillna(data['umur'].mean())

In [56]:
data

    Nama  umur   gaji negara
0   budi  25.0  50000     ID
1   budi  25.0  50000     ID
2  putra  30.0  60000     UK
3   nedy  26.0  55000     ID
4  David  28.0  45000    USA
5   rico  22.0  70000     UK

In [57]:
data.duplicated().value_counts()

False    5
True     1
Name: count, dtype: int64

In [58]:
#hitung data duplikat
data.duplicated().sum()

np.int64(1)

In [59]:
#hapus data duplicate
data = data.drop_duplicates()
data

    Nama  umur   gaji negara
0   budi  25.0  50000     ID
2  putra  30.0  60000     UK
3   nedy  26.0  55000     ID
4  David  28.0  45000    USA
5   rico  22.0  70000     UK

In [60]:
data.shape

(5, 4)

In [61]:
#ganti dtype columns negara
convert_negara = pd.get_dummies(data['negara'], prefix='negara').astype(int)
data = pd.concat([data, convert_negara], axis = 1)
data.drop('negara', axis=1, inplace=True)
data

    Nama  umur   gaji  negara_ID  negara_UK  negara_USA
0   budi  25.0  50000          1          0           0
2  putra  30.0  60000          0          1           0
3   nedy  26.0  55000          1          0           0
4  David  28.0  45000          0          0           1
5   rico  22.0  70000          0          1           0

In [ ]:
'''
numeric_cols = ['umur', 'gaji']
for col in numeric_cols:
    mean = data[col].mean()
    std = data[col].std()
    data[col] = (data[col] - mean) / std
'''
numeric_cols = ['umur', 'gaji']
for col in numeric_cols:
    mean = data[col].mean()
    std = data[col].std()
    data[col] = (data[col] - mean) / std

In [65]:
data

    Nama      umur      gaji  negara_ID  negara_UK  negara_USA
0   budi -0.395628 -0.623850          1          0           0
2  putra  1.252823  0.415900          0          1           0
3   nedy -0.065938 -0.103975          1          0           0
4  David  0.593442 -1.143726          0          0           1
5   rico -1.384699  1.455651          0          1           0